; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-25)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room3)
(at ball18 room3)
(at ball19 room4)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 room3)
(at ball12 room3)
(at ball13 room3)
(at ball14 room3)
(at ball15 room3)
(at ball16 room4)
(at ball17 room4)
(at ball18 room4)
(at ball19 room4)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room5)
(at ball24 room5)
(at ball25 room5)
)
)
)

; plan
1. (pick ball8 rooma left)
   deleted: (at ball8 rooma) (free left)
   added: (carry ball8 left)
   goals met: 16 of 25
2. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 25
3. (drop ball8 roomb left)
   deleted: (carry ball8 left)
   added: (at ball8 roomb) (free left)
   goals met: 17 of 25
4. (pick ball13 roomb left)
   deleted: (at ball13 roomb) (free left)
   added: (carry ball13 left)
   goals met: 17 of 25
5. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 17 of 25
6. (drop ball13 room3 left)
   deleted: (carry ball13 left)
   added: (at ball13 room3) (free left)
   goals met: 18 of 25
7. (pick ball18 room3 left)
   deleted: (at ball18 room3) (free left)
   added: (carry ball18 left)
   goals met: 18 of 25
8. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 18 of 25
9. (drop ball18 room4 left)
   deleted: (carry ball18 left)
   added: (at ball18 room4) (free left)
   goals met: 19 of 25
10. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 19 of 25
11. (pick ball12 roomb left)
   deleted: (at ball12 roomb) (free left)
   added: (carry ball12 left)
   goals met: 19 of 25
12. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 19 of 25
13. (drop ball12 room3 left)
   deleted: (carry ball12 left)
   added: (at ball12 room3) (free left)
   goals met: 20 of 25
14. (pick ball17 room3 left)
   deleted: (at ball17 room3) (free left)
   added: (carry ball17 left)
   goals met: 20 of 25
15. (move room3 room4)
   deleted: (at-robby room3)
   added: (at-robby room4)
   goals met: 20 of 25
16. (drop ball17 room4 left)
   deleted: (carry ball17 left)
   added: (at ball17 room4) (free left)
   goals met: 21 of 25
17. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 21 of 25
18. (pick ball11 roomb left)
   deleted: (at ball11 roomb) (free left)
   added: (carry ball11 left)
   goals met: 21 of 25
19. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 21 of 25
20. (drop ball11 room3 left)
   deleted: (carry ball11 left)
   added: (at ball11 room3) (free left)
   goals met: 22 of 25
21. (pick ball16 room3 left)
   deleted: (at ball16 room3) (free left)
   added: (carry ball16 left)
   goals met: 22 of 25
22. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 22 of 25
23. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 22 of 25
24. (drop ball16 room4 left)
   deleted: (carry ball16 left)
   added: (at ball16 room4) (free left)
   goals met: 23 of 25
25. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 23 of 25
26. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 23 of 25
27. (pick ball7 rooma left)
   deleted: (at ball7 rooma) (free left)
   added: (carry ball7 left)
   goals met: 23 of 25
28. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 23 of 25
29. (drop ball7 roomb left)
   deleted: (carry ball7 left)
   added: (at ball7 roomb) (free left)
   goals met: 24 of 25
30. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 24 of 25
31. (pick ball6 rooma left)
   deleted: (at ball6 rooma) (free left)
   added: (carry ball6 left)
   goals met: 24 of 25
32. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 24 of 25
33. (drop ball6 roomb left)
   deleted: (carry ball6 left)
   added: (at ball6 roomb) (free left)
   goals met: 25 of 25
